{"pages":[],"posts":[{"title":"Echarts采坑之路","text":"这两天在Vue项目中使用Echarts组件进行画图，遇到了一些坑，也找到了解决办法，现在把记录下来，以免再次掉坑。如有不对的地方，还请大家给我留言指正。 tooltip的自定义所谓的tooltip就是 而官方的tooltip是它的生成方式是1234567891011121314151617181920option = { tooltip: { trigger: 'item', formatter: \"{a} &lt;br/&gt;{b}: {c} ({d}%)\" }, legend: { .................... }, series: [ { name:'访问来源', type:'pie', ..................... data:[ {value:335, name:'直接访问'}, ............. ] } ]} 其中tooltip属性下的formatter是决定其格式的重要环节，问题来了，这个a,b,c,d是什么鬼，它们是固定的么？让我们一起来看一下官方api可以看出可用的数据只有c也就是data =&gt; value，而d的比例还是根据这个自动生成的，如果想引入其他的数据的话就需要第二种回调函数的形式，其中第一个参数params是formatter需要的数据集，其格式是固定的所以只需要在传入原始数据项给data时，将所需要的相关数据一并传入，再通过属性调用即可。1234567891011121314for(let item in temp){ nameArr.push(item) let obj = {} obj.value = 1 obj.name = item obj.num = temp[item].num obj.fieldNum = temp[item].fieldNum dataArr.push(obj)}metadataInfo.setOption({ tooltip: { trigger: 'item', formatter: (params) =&gt; (\"图层数量:\"+params.data.num+\"&lt;br&gt;要素数量:\"+params.data.fieldNum) }, 最后就能得到我们想要的效果了 同一区域echarts之间切换不覆盖问题概述所谓不覆盖就是，我在同一个div中需要绘制几个不同的图，当点击按钮时在图之间切换，而图与图之间的数据不会相互影响。 例如初始加载第一张“按图层”的柱状图a(正常)点击“按年份”切换到折线图b(正常) 问题来了~~~再点击“按图层”时加载的柱状图a就不对劲了，出现了折线图b的影子","link":"/2018/11/27/Echarts采坑之路/"},{"title":"2018年快结束了，我已经25了“","text":"我的未来式 2018年11月24日，周六 继周五，也就是昨天，感冒请假1天后，又到了“愉快”的周末。仿佛昨晚的开黑还不够尽兴，今天，周六考虑这个特殊的时间点，“本”就该放松休息，早上醒来躺在床上玩会手游，到了9点有点饿，于是不得已起床去买了早餐。回来也才9点多点，时间还早干嘛呢，这么多时间怎么“挥霍”呢？是打DOTA呢，还是去b站看电影或电视剧呢，that is a question……（不管干了啥，很快2小时过去了，到了饭点）下楼吃完午饭回来，已经1点了，时间又还早（为什么要加又呢）做啥呢，还是继续边打手游边看日剧吧…好开心……（一通吃喝玩乐，不知不觉快5点了） 转折点来了，老妈发来问候消息，聊着聊着，又到了我一直逃避的话题（回来考个公务员吧，去事业单位工作稳定）为什么老一辈的人就那么希望我们进事业单位呢？原来老姐最近又在考试准备进事业单位，貌似考得还不错，就差政审了……（又开始了绕不开的论点）老妈觉得对我不够严格，谁谁家孩子以前学习成绩不好的，现在都出人头地了总之我们两最后谁也没有说服谁，就这样不了了之了。 虽然我和老妈的争论结束了，却把想在周末逃避现实的我又拉回了现实，胡玩疯玩，无所事事的状态及时止住了。 关上灯，在黑漆漆的屋子（冬天天黑的特别早）里，一个人对着天花板思考着我的未来在哪里，对于考公务员我确实是怎么都提不起兴趣，但是这样每个周末都无所事事，昏昏沉沉，确实也不是我该有的状态，再次提醒自己 你的目前状态年龄：25工作：在一家小公司，拿着10k的收入在上海苟延残喘女朋友：无房子：无车子：无额外收入：无 经过一番思想斗争，得出结论，虽然还是不决定考公务员，但是还是要考点什么杜绝无所事事。要给自己找点事干，不能整天在屋里死宅或是出去吃狗粮。 1.还做程序员么?（A.做 B.不做） A =&gt; 继续前端这条路， 那么考证什么的到还是次要的，关键是平时的时间能否利用起来，多学习一点，基础打扎实一点，明年回南京好找一个更好的工作 B =&gt; 不做程序员，那么考研应该是个不错的选择，是自己和家人所希望的。既然明年回南京，那么考个南京高校的研究生吧。考哪个专业的呢，目前有想法的有2个 （B1.计算机 B2.经济） B1 =&gt; 考计算机优势：有考上的大学同学可以取经劣势：难度会不会有点大（如果是南大的，会不会不好考）出来以后继续从事计算机方面的工作 B2 =&gt; 经济类优势：有考过，多多少少对于内容有些印象劣势：如果还是考南大的经济类（还是难度的问题）出来转行，从事经济方面的工作 还未确定的话，先把英语和数学复习起来","link":"/2018/11/24/2018年快结束了，我已经25了“/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2018/11/21/hello-world/"},{"title":"你好，Hexo","text":"Markdown初体验很多语法想试一下，比如加粗，比如说斜体，再比如说删除线 引用列夫托尔斯泰的一句话 : “ 每个人都会有缺陷，就像被上帝咬过的苹果，有的人缺陷比较大，那是因为上帝特别喜欢他的芬芳。” 无序列表 列表1 列表2 列表3 有序列表 列表4 列表5 列表6 表格 姓名 技能 排行 白羊座:穆 星尘毁灭 1 金牛座:阿鲁迪巴 巨角轰击 2 双子座:撒加 地爆天星 3 巨蟹座:迪斯马斯克 黄泉颤抖 4 狮子座:艾欧里亚 闪电光速拳 5 处女座:沙加 如来涅槃 6 天秤座:童虎 庐山百龙霸 7 天蝎座:米罗 猩红毒针 8 射手座:艾俄洛斯 黄金箭 9 摩羯座:修罗 圣剑 10 水瓶座:卡妙 曙光女神之宽恕 11 双鱼座:阿布罗狄 食人鱼玫瑰 12 代码const a = 1() if (a &gt; 0){ b = 1 } else { c = 1 } ()","link":"/2018/11/22/你好，Hexo/"}],"tags":[],"categories":[]}